sub_box = {
    ' ': '00', '!': '01', '"': '02', '#': '03', '$': '04', '%': '05', '&': '06', "'": '07', '(': '08', ')': '09', '*': '10', '+': '11', ',': '12', '-': '13', 
    '.': '14', '/': '15', '0': '16', '1': '17', '2': '18', '3': '19', '4': '20', '5': '21', '6': '22', '7': '23', '8': '24', '9': '25', ':': '26', ';': '27', 
    '<': '28', '=': '29', '>': '30', '?': '31', '@': '32', 'A': '33', 'B': '34', 'C': '35', 'D': '36', 'E': '37', 'F': '38', 'G': '39', 'H': '40', 'I': '41',
    'J': '42', 'K': '43', 'L': '44', 'M': '45', 'N': '46', 'O': '47', 'P': '48', 'Q': '49', 'R': '50', 'S': '51', 'T': '52', 'U': '53', 'V': '54', 'W': '55', 
    'X': '56', 'Y': '57', 'Z': '58', '[': '59', '\\': '60', ']': '61', '^': '62', '_': '63', '`': '64', 'a': '65', 'b': '66', 'c': '67', 'd': '68', 'e': '69', 
    'f': '70', 'g': '71', 'h': '72', 'i': '73', 'j': '74', 'k': '75', 'l': '76', 'm': '77', 'n': '78', 'o': '79', 'p': '80', 'q': '81', 'r': '82', 's': '83', 
    't': '84', 'u': '85', 'v': '86', 'w': '87', 'x': '88', 'y': '89', 'z': '90', '{': '91', '|': '92', '}': '93', '~': '94'}

# ПРОВЕРКА: все ли введённые символы печатаемые
def check(password): 
    for symbol in password:
        if ord(symbol) < 32 or ord(symbol) > 126:
            print("Найден непечатаемый символ")
            exit()


# Фиксация длины
def fix(password):
    if len(password) < 8:
        return password.ljust(8, "*")
    else:
         password = password[0:8]
    return password

# Хеширование
def scramble(password):
    h = ""
    for l in password:
        h += sub_box[l]

    h = h[::-1]
    h = h[8:16] + h[0:8]
    h = h[0:4] + h[8:12] + h[12:16] + h[4:8]

    hash = ""
    for i in range(16):
        hash += str(( int(h[i]) + (i%8) ) % 10)
    return hash


password = input("Введите пароль: ")
check(password)
password = fix(password)
hash = scramble(password)
print("HASH OF PASSWORD: ", hash)
